/////////////////////////////////////////////////////////////////////////
///// Структуры обмена пр.МО3 и станции МО3К 						/////
/////  в рамках Авиационного Канала при работе в режиме МО1К		/////
/////////////////////////////////////////////////////////////////////////
//pdn [Изм.17.12.2012]
typedef struct	{
	unsigned short	cr_com;	//порядковый номер последней выполненной команды  
							//0-USHRT_MAX
	short	num_com;		//номер последеней команды по перечню
	int		lp2_param;	//значение параметра последней команды

	short	kzv;			//код завершения последней команды (0 - норма, 1 - не норма(ошибка), 2 - команда отменена)

} obmen_AK_MO3K_MN3_t;


typedef struct	{
	unsigned short	cr_com;	//порядковый номер последней команды, выданной из пр.мн3 в пр.мо3к 
							//0-USHRT_MAX

	short num_com;		//номер последеней команды по перечню
	int	 a_params[5];	//массив параметров команды управления

	short	Pr_bearing; //признак передачи пеленга (0-откл,1-вкл)
	float	Peleng;		//пеленг аненны. через 1 сек., рад
	float	beta;	//угол места антенны через 1 сек., рад

} obmen_AK_MN3_MO3K_t;
/////////////////////////////////////////////////////////////////////////

